wrk/async_res/wrk_put.txt
Running 20s test @ http://127.0.0.1:8080
  2 threads and 1024 connections
  Thread calibration: mean lat.: 0.817ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.898ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   832.62us  303.48us   2.90ms   59.60%
    Req/Sec     2.77k   767.57     4.78k    61.10%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  831.00us
 75.000%    1.09ms
 90.000%    1.24ms
 99.000%    1.41ms
 99.900%    1.52ms
 99.990%    2.01ms
 99.999%    2.90ms
100.000%    2.90ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.177     0.000000            1         1.00
       0.427     0.100000         3908         1.11
       0.525     0.200000         7835         1.25
       0.628     0.300000        11720         1.43
       0.726     0.400000        15652         1.67
       0.831     0.500000        19534         2.00
       0.889     0.550000        21494         2.22
       0.934     0.600000        23472         2.50
       0.979     0.650000        25422         2.86
       1.037     0.700000        27363         3.33
       1.093     0.750000        29319         4.00
       1.116     0.775000        30292         4.44
       1.137     0.800000        31287         5.00
       1.158     0.825000        32258         5.71
       1.182     0.850000        33241         6.67
       1.208     0.875000        34216         8.00
       1.223     0.887500        34686         8.89
       1.240     0.900000        35173        10.00
       1.258     0.912500        35666        11.43
       1.276     0.925000        36170        13.33
       1.292     0.937500        36636        16.00
       1.302     0.943750        36892        17.78
       1.312     0.950000        37127        20.00
       1.321     0.956250        37365        22.86
       1.332     0.962500        37622        26.67
       1.342     0.968750        37850        32.00
       1.347     0.971875        37975        35.56
       1.353     0.975000        38104        40.00
       1.360     0.978125        38217        45.71
       1.369     0.981250        38335        53.33
       1.380     0.984375        38454        64.00
       1.387     0.985938        38518        71.11
       1.394     0.987500        38579        80.00
       1.400     0.989062        38637        91.43
       1.409     0.990625        38700       106.67
       1.416     0.992188        38761       128.00
       1.422     0.992969        38793       142.22
       1.428     0.993750        38822       160.00
       1.435     0.994531        38852       182.86
       1.442     0.995313        38880       213.33
       1.451     0.996094        38913       256.00
       1.458     0.996484        38928       284.44
       1.462     0.996875        38941       320.00
       1.470     0.997266        38957       365.71
       1.479     0.997656        38972       426.67
       1.488     0.998047        38987       512.00
       1.496     0.998242        38996       568.89
       1.501     0.998437        39002       640.00
       1.507     0.998633        39011       731.43
       1.515     0.998828        39018       853.33
       1.522     0.999023        39025      1024.00
       1.531     0.999121        39029      1137.78
       1.535     0.999219        39033      1280.00
       1.545     0.999316        39037      1462.86
       1.553     0.999414        39041      1706.67
       1.580     0.999512        39044      2048.00
       1.595     0.999561        39046      2275.56
       1.615     0.999609        39048      2560.00
       1.637     0.999658        39050      2925.71
       1.735     0.999707        39053      3413.33
       1.751     0.999756        39054      4096.00
       1.818     0.999780        39055      4551.11
       1.874     0.999805        39056      5120.00
       1.980     0.999829        39057      5851.43
       1.986     0.999854        39058      6826.67
       2.013     0.999878        39059      8192.00
       2.013     0.999890        39059      9102.22
       2.537     0.999902        39060     10240.00
       2.537     0.999915        39060     11702.86
       2.705     0.999927        39061     13653.33
       2.705     0.999939        39061     16384.00
       2.705     0.999945        39061     18204.44
       2.793     0.999951        39062     20480.00
       2.793     0.999957        39062     23405.71
       2.793     0.999963        39062     27306.67
       2.793     0.999969        39062     32768.00
       2.793     0.999973        39062     36408.89
       2.903     0.999976        39063     40960.00
       2.903     1.000000        39063          inf
#[Mean    =        0.833, StdDeviation   =        0.303]
#[Max     =        2.902, Total count    =        39063]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  102058 requests in 20.00s, 6.52MB read
  Socket errors: connect 5, read 0, write 0, timeout 3685
Requests/sec:   5102.90
Transfer/sec:    333.88KB