wrk/async_res/wrk_put_under_status.txt
Running 30s test @ http://127.0.0.1:8080
  2 threads and 1024 connections
  Thread calibration: mean lat.: 0.784ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.777ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   802.41us  345.39us  15.24ms   69.29%
    Req/Sec     3.11k   487.28     4.33k    64.63%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  789.00us
 75.000%    1.06ms
 90.000%    1.21ms
 99.000%    1.38ms
 99.900%    2.47ms
 99.990%    8.99ms
 99.999%   14.90ms
100.000%   15.25ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.162     0.000000            2         1.00
       0.386     0.100000        10317         1.11
       0.493     0.200000        20568         1.25
       0.588     0.300000        30844         1.43
       0.690     0.400000        41129         1.67
       0.789     0.500000        51443         2.00
       0.854     0.550000        56553         2.22
       0.901     0.600000        61786         2.50
       0.943     0.650000        66824         2.86
       1.004     0.700000        72021         3.33
       1.063     0.750000        77126         4.00
       1.086     0.775000        79753         4.44
       1.106     0.800000        82242         5.00
       1.127     0.825000        84864         5.71
       1.149     0.850000        87491         6.67
       1.174     0.875000        89943         8.00
       1.191     0.887500        91260         8.89
       1.210     0.900000        92560        10.00
       1.230     0.912500        93800        11.43
       1.251     0.925000        95134        13.33
       1.271     0.937500        96404        16.00
       1.281     0.943750        97064        17.78
       1.290     0.950000        97676        20.00
       1.300     0.956250        98337        22.86
       1.310     0.962500        98939        26.67
       1.322     0.968750        99620        32.00
       1.328     0.971875        99907        35.56
       1.335     0.975000       100235        40.00
       1.342     0.978125       100548        45.71
       1.350     0.981250       100882        53.33
       1.360     0.984375       101197        64.00
       1.365     0.985938       101340        71.11
       1.372     0.987500       101501        80.00
       1.380     0.989062       101675        91.43
       1.388     0.990625       101820       106.67
       1.400     0.992188       101990       128.00
       1.407     0.992969       102064       142.22
       1.415     0.993750       102146       160.00
       1.425     0.994531       102221       182.86
       1.437     0.995313       102303       213.33
       1.453     0.996094       102382       256.00
       1.464     0.996484       102421       284.44
       1.478     0.996875       102462       320.00
       1.502     0.997266       102503       365.71
       1.542     0.997656       102541       426.67
       1.624     0.998047       102582       512.00
       1.707     0.998242       102601       568.89
       1.837     0.998437       102621       640.00
       2.025     0.998633       102641       731.43
       2.283     0.998828       102661       853.33
       2.523     0.999023       102681      1024.00
       2.657     0.999121       102691      1137.78
       2.893     0.999219       102701      1280.00
       3.085     0.999316       102711      1462.86
       3.425     0.999414       102721      1706.67
       3.795     0.999512       102731      2048.00
       3.999     0.999561       102736      2275.56
       4.171     0.999609       102741      2560.00
       4.543     0.999658       102747      2925.71
       5.147     0.999707       102751      3413.33
       5.907     0.999756       102756      4096.00
       6.139     0.999780       102759      4551.11
       6.291     0.999805       102761      5120.00
       7.335     0.999829       102764      5851.43
       7.539     0.999854       102766      6826.67
       7.867     0.999878       102769      8192.00
       8.543     0.999890       102770      9102.22
       8.991     0.999902       102771     10240.00
       9.303     0.999915       102773     11702.86
      10.391     0.999927       102774     13653.33
      10.807     0.999939       102775     16384.00
      11.239     0.999945       102776     18204.44
      11.239     0.999951       102776     20480.00
      11.735     0.999957       102777     23405.71
      12.943     0.999963       102778     27306.67
      12.943     0.999969       102778     32768.00
      14.887     0.999973       102779     36408.89
      14.887     0.999976       102779     40960.00
      14.887     0.999979       102779     46811.43
      14.895     0.999982       102780     54613.33
      14.895     0.999985       102780     65536.00
      14.895     0.999986       102780     72817.78
      14.895     0.999988       102780     81920.00
      14.895     0.999989       102780     93622.86
      15.247     0.999991       102781    109226.67
      15.247     1.000000       102781          inf
#[Mean    =        0.802, StdDeviation   =        0.345]
#[Max     =       15.240, Total count    =       102781]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  174841 requests in 30.00s, 11.17MB read
  Socket errors: connect 5, read 0, write 0, timeout 5192
Requests/sec:   5827.99
Transfer/sec:    381.32KB